src/main/java/compilador/App.org
#+property: header-args :tangle App.java :comments link

* imports
#+begin_src java :noweb-ref imports
package compilador;

import java.nio.file.Path;
import java.util.regex.Pattern;
import java.nio.file.Paths;
import java.io.IOException;
import java.nio.file.Files;
import java.util.regex.Matcher;
#+end_src

* number
- Which exceptions should be thrown?
#+begin_src java :noweb-ref Arithmetic
class Arithmetic {
    public enum Keywords {};

    public static String tokenize(String code) throws  {
        Pattern pattern = Pattern.compile("\\d+");
        String matches[];
        Matcher matcher = pattern.matcher(code);
        while (matcher.find()) {
            matches.append(matcher.group());
        }
        if (matches.length == 0) {
            throw Exception;
        }
    }

    public static void main(String[] args) {
        // It will only accept one file.
        if (args.length != 1) {
            System.out.println("Wrong number of parameters provided.");
            return;
        }

        System.out.println(tokenize(args[0]));

        Path path = Paths.get(args[0]);
        String text;
        try {
            text = String.join("\n", Files.readAllLines(path));
        } catch (IOException e) {
            System.out.println("Error " + e.getMessage());
            e.printStackTrace();
            return;
        }

    }
}
#+end_src

#+begin_src java :noweb-ref App
public class App {
    public static void main( String[] args ) {
        System.out.println("Hello World!");
    }
}
#+end_src
** tokenizer
#+begin_src
[a-zA-Z_]
/^
(\w+ )+ # keyword in var/function declaration
 +
(IDENTIFIER) # varname
 *
(= *(?EXPR))
;$
/
#+end_src
